# Statitical Analysis

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [5]:
Number = [1,2,3,4,5,6,7,8,9,10]
Names = ['Ali Ahmed','Mohamed Ziad','Majid Salim','Salwa Ahmed', 'Ahlam Mohamed', 'Omar Ali', 'Amna Mohammed','Khalid Yousif', 'Safa Humaid', 'Amjad Tayel']
City = ['Fujairah','Dubai','Sharjah','AbuDhabi','Fujairah','Dubai', 'Sharja ', 'AbuDhabi','Sharjah','Fujairah']
columns = ['Number', 'Name', 'City' ]

In [6]:
df = pd.DataFrame({'Number':Number,'Name':Names,'City':City},columns=columns)
Gender= pd.DataFrame({'Gender':['Male','Male','Male','Female',
'Female', 'Male', 'Female', 'Male','Female', 'Male']})
Height = pd.DataFrame(np.random.randint(120,175, size=(12, 1)))
Weight = pd.DataFrame(np.random.randint(50,110, size=(12, 1)))
df['Gender'] = Gender
df['Height'] = Height
df['Weight'] = Weight
df.set_index('Number')
df

   Number           Name      City  Gender  Height  Weight
0       1      Ali Ahmed  Fujairah    Male     133      75
1       2   Mohamed Ziad     Dubai    Male     156      94
2       3    Majid Salim   Sharjah    Male     143      71
3       4    Salwa Ahmed  AbuDhabi  Female     154      68
4       5  Ahlam Mohamed  Fujairah  Female     152      89
5       6       Omar Ali     Dubai    Male     159     105
6       7  Amna Mohammed   Sharja   Female     132      74
7       8  Khalid Yousif  AbuDhabi    Male     126      72
8       9    Safa Humaid   Sharjah  Female     169      67
9      10    Amjad Tayel  Fujairah    Male     126      84

In [7]:
df.describe()

         Number      Height      Weight
count  10.00000   10.000000   10.000000
mean    5.50000  145.000000   79.900000
std     3.02765   15.136417   12.635488
min     1.00000  126.000000   67.000000
25%     3.25000  132.250000   71.250000
50%     5.50000  147.500000   74.500000
75%     7.75000  155.500000   87.750000
max    10.00000  169.000000  105.000000

In [8]:
df.corr()

/tmp/ipykernel_6020/1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

          Number    Height    Weight
Number  1.000000 -0.140623 -0.100203
Height -0.140623  1.000000  0.220182
Weight -0.100203  0.220182  1.000000

In [9]:
df.max()

Number             10
Name      Salwa Ahmed
City          Sharjah
Gender           Male
Height            169
Weight            105
dtype: object

In [10]:
df.median()

/tmp/ipykernel_6020/530051474.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

Number      5.5
Height    147.5
Weight     74.5
dtype: float64

In [11]:
df.groupby('City')

In [12]:
df.groupby('City')['Gender']

In [13]:
df.groupby('City')['Gender'].count()

City
AbuDhabi    2
Dubai       2
Fujairah    3
Sharja      1
Sharjah     2
Name: Gender, dtype: int64

In [14]:
df.groupby('City').groups()

TypeError: 'PrettyDict' object is not callable

In [16]:
df.groupby('City').groups

{'AbuDhabi': [3, 7], 'Dubai': [1, 5], 'Fujairah': [0, 4, 9], 'Sharja ': [6], 'Sharjah': [2, 8]}

In [17]:
df.groupby(['City','Gender']).groups

{('AbuDhabi', 'Female'): [3], ('AbuDhabi', 'Male'): [7], ('Dubai', 'Male'): [1, 5], ('Fujairah', 'Female'): [4], ('Fujairah', 'Male'): [0, 9], ('Sharja ', 'Female'): [6], ('Sharjah', 'Female'): [8], ('Sharjah', 'Male'): [2]}

In [18]:
group = df.groupby('Gender')
group

In [19]:
for name, groupy in group:
    print(name)
    print(groupy)

Female
   Number           Name      City  Gender  Height  Weight
3       4    Salwa Ahmed  AbuDhabi  Female     154      68
4       5  Ahlam Mohamed  Fujairah  Female     152      89
6       7  Amna Mohammed   Sharja   Female     132      74
8       9    Safa Humaid   Sharjah  Female     169      67
Male
   Number           Name      City Gender  Height  Weight
0       1      Ali Ahmed  Fujairah   Male     133      75
1       2   Mohamed Ziad     Dubai   Male     156      94
2       3    Majid Salim   Sharjah   Male     143      71
5       6       Omar Ali     Dubai   Male     159     105
7       8  Khalid Yousif  AbuDhabi   Male     126      72
9      10    Amjad Tayel  Fujairah   Male     126      84

In [20]:
group.get_group('Female')

   Number           Name      City  Gender  Height  Weight
3       4    Salwa Ahmed  AbuDhabi  Female     154      68
4       5  Ahlam Mohamed  Fujairah  Female     152      89
6       7  Amna Mohammed   Sharja   Female     132      74
8       9    Safa Humaid   Sharjah  Female     169      67

In [22]:
grouped = df.groupby('Gender').groups

In [23]:
grouped

{'Female': [3, 4, 6, 8], 'Male': [0, 1, 2, 5, 7, 9]}

In [27]:
grouped = df.groupby('Gender')
grouped

In [28]:
grouped['Height']

In [ ]:
## Aggregation

In [33]:
grouped['Height'].agg(np.mean)

Gender
Female    151.75
Male      140.50
Name: Height, dtype: float64

In [34]:
grouped['Weight'].agg(np.median)

Gender
Female    71.0
Male      79.5
Name: Weight, dtype: float64

In [35]:
grouped.agg(np.size)

        Number  Name  City  Height  Weight
Gender
Female       4     4     4       4       4
Male         6     6     6       6       6

In [36]:
grouped['Height'].agg([np.mean,np.std,np.median])

          mean        std  median
Gender
Female  151.75  15.195942   153.0
Male    140.50  14.597945   138.0

## Transformation